Repository: ibrahim-s/maagimAraby
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar

source: Maagim Araby
ar: المعاجم العربية

source: Opens Maagim araby dialog to get meaning of arabic words.
ar: فتح محاورةْ المعاجم العربية, للحصول على معنى الكلمة العربية

source: Default full browser
ar: المتصفح الإفتراضي العادي

source: Browser window only
ar: نافذةْ المتصفح فقط

source: NVDA browseable message box(choose it after testing)
ar: نافذةْ NVDA browseable message box(مِن الأفضل تجربتها قبل الإختيار)

source: Choose type of window To Display Result:
ar: اختيار نافذةْ النتائج:

source: &Close Maagim Araby Dialog after requesting translation
ar: إغلاق محاورةْ المعاجم العربية بعد طلب معنى الكلمة

source: Check for update on startup
ar: تَحقق من وجود تحديث للإضافة عند بدء التشغيل

source: Enter a word please
ar: أَدْخِلْ كلمة فضلا

source: Choose Dictionary
ar: اختر القاموس

source: OK
ar: موافق

source: cancel
ar: إلغاء

source: Sorry, Service not available({})
ar: عُذرا, الخدمة غير متاحة({})

source: It is available a new version {} of this add-on. Do you want to update?
ar: يتوفر إصدار جديد {} من هذه الإضافة. هل تريد التحديث؟

source: {}-Update
ar: {}-تحديث

source: This new version of this add-on is not compatible with your version of NVDA. The update process will be terminated.
ar: هذا الإصدار الجديد من هذه الإضافة غير متوافق مع إصدار NVDA لديك. سيتم إنهاء عملية التحديث.

source: This addon helps get the meaning of arabic words from several arabic dictionaries on www.almaany.com website. Press nvda+Alt+M, Maagim Araby dialog will be displayed, and you will be standing on an edit field. If when pressing this command, you were standing on a selected word, the word will be put in the edit field. Otherwise, enter in the edit field the word you want, tab an choose the dictionary you want and press enter. The meaning of the word will be displayed in a separate browseable window.
ar: هذه الإضافة تساعدك على الحصول على معاني الكلمات العربية في معاجم عربية عديدة من خلال موقع www.almaany.com. بالضغط على الإختصار nvda+Alt+M, ستظهر لك محاورةْ المعاجم العربية, و ستكون واقفا على مربع تحرير. و قَبلَ ضغط الإختصار, إذا كنت واقفا على كلمة محددة, هذه الكلمة ستظهر في مربع التحرير أو, اكتب في مربع التحرير الكلمة التي تريد, ثم إضغط تاب لتقف على قائمةْ المعاجم إختر منها القاموس الذي تريد و اضغطْ عليه إنتر. و بعد ذاك سيظهر معنى الكلمة في نافذةْ تستطيع قراءتها و التنقل فيها كما في المتصفح.
